Repository: s3927562/Battleship-Final
Catalog: Battleship/*.lproj/Localizable.strings
Languages: vi

source: %lld x %lld Grid, Maximum %lld Moves
vi: Lưới %lld x %lld, Tối đa %lld nước đi

source: Achievements
vi: Thành tích

source: Appearance
vi: Giao diện

source: Back to Game
vi: Quay về Trò chơi

source: Battleship
vi: Tàu chiến

source: Better Luck Next Time
vi: Chúc may mắn lần sau

source: BGM
vi: Nhạc nền

source: Cancel
vi: Huỷ

source: Changes will take effect from the next new game
vi: Thay đổi sẽ có hiệu lực từ trò chơi mới tiếp theo

source: Changing the language will close the app
vi: Thay đổi ngôn ngữ sẽ đóng ứng dụng

source: Continue
vi: TIếp tục

source: Dark Mode
vi: GIao diện Tối

source: Data cannot be reset during gameplay
vi: Dữ liệu không thể bị xoá khi đang chơi

source: Difficulty
vi: Độ khó

source: Don't Save
vi: Không Lưu

source: Easy
vi: Dễ

source: Game Over
vi: Thua cuộc

source: Games Total
vi: Trò chơi Tổng

source: Games Won
vi: Trò chơi Thắng

source: Good Job
vi: Tốt

source: Hard
vi: Khó

source: How to Play
vi: Hướng dẫn

source: In each game, a fleet will be deployed with 5 ships of the following size: 2, 3, 3, 4, 5.
vi: Trong mỗi trò chơi, một hạm đội gồm 5 thuyền sẽ được triển khai với các kích cỡ: 2, 3, 3, 4, 5.

source: Information
vi: Thông tin

source: Language
vi: Ngôn ngữ

source: Leaderboard
vi: Bảng xếp hạng

source: Leaderboards, Statistics & Achievements
vi: Bảng xếp hạng, Thống kê & Thành tích

source: Lose a game
vi: Thua một trò chơi

source: Main Menu
vi: Màn hình Chính

source: Medium
vi: Trung bình

source: Moves: %lld / %lld
vi: Nước đi: %lld / %lld

source: Name
vi: Tên

source: Name: Tran Thanh Tung Student ID: s3927562 Program: BH120 - Bachelor of Engineering (Software Engineering) (Honours)
vi: Tên: Trần Thanh Tùng Số hiệu Sinh viên: s3927562 Chương trình: BH120 - Kỹ sư (Kỹ thuật Phần mềm)

source: New Game
vi: Trò chơi Mới

source: None
vi: Trống

source: Open Settings app
vi: Mở ứng dụng Cài đặt

source: Perfect Game
vi: Trò chơi Hoàn hảo

source: Reset
vi: Xoá

source: Reset All Data
vi: Xoá toàn bộ dữ liệu

source: Save
vi: Lưu

source: Score
vi: Điểm

source: Settings
vi: Cài đặt

source: SFX
vi: Hiệu ứng

source: Statistics
vi: Thống kê

source: Tapping on the button will shoot at the location and provide a hint to whether the shot hit a ship or not:
vi: Khi ấn vào nút, bạn sẽ bắn vào toạ độ đó và hiển thị một gợi ý xem bạn có bắn trúng thuyền không:

source: The field is a square grid with the dimension based on the difficulty. Each location is represented with a blank button.
vi: Khu biển là một lưới hình vuông với diện tích phụ thuộc vào độ khó. Mỗi toạ độ được hiển thị là một nút vuông trống.

source: The score is calculated by adding 1 to the remaining move count.
vi: Số điểm sẽ được tính bằng cách lấy số nước đi còn lại cộng 1.

source: The shot did not hit anything.
vi: Không trúng.

source: The shot hit a ship and the ship has sunk.
vi: Trúng và thuyền đã chìm.

source: The shot hit a ship, but the ship has not sunk.
vi: Trúng nhưng thuyền chưa chìm.

source: This action cannot be undone
vi: Hành động này không thể hoàn tác

source: Volume
vi: Âm thanh

source: Win a game
vi: Thắng một trò chơi

source: Win a game without any miss
vi: Thắng một trò chơi mà không bắn trượt

source: You must sink all ships before you run out of move. The move counter and limit is displayed at the bottom of the scren.
vi: Bạn phải bắn chìm tất cả các thuyền trước khi hết nước đi. Số nước đi đã thực hiện và số nước đi tối đa được hiển thị ở phía dưới của màn hình.

source: You Won!
vi: Thắng cuộc!
